---
kind: property
id: P:Autodesk.Revit.DB.Visual.Speckle.SpeckleColor1
source: html/52088399-e6dc-b12b-4ed3-844af990ac28.htm
---
# Autodesk.Revit.DB.Visual.Speckle.SpeckleColor1 Property

The property labeled "Color 1" from the "Speckle" schema.

## Syntax (C#)
```csharp
public static string SpeckleColor1 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.